/********************************************************
 * file       : Q4.c                                    *
 * date       : 2022/06/27                              *
 * author     : littleboy                               *
 * description: 依次打印一个十进制整数, 字符串和浮点值, *
 *              你应该在 prinf 函数中分别使用什么格式的 *
 *              代码? 试编一例, 让这些打印值以空格分隔, *
 *              并在输入行的末尾添加一个换行符。        *
 *******************************************************/
#include "stdio.h"

int main()
{
    printf("%d %s %.2f\n", 1, "hello, world", 0.2);
	return 0;
}
